from .arkhangelskiy_corpora import PageParser

language = 'armenian1'
results = 'http://eanc.net/EANC/search/results.php'

TEST_DATA = {'test_single_query': {'query': 'կատու'},
             'test_multi_query': {'query': ['կատու', 'սիրով']}
             }

__author__ = 'ustya-k'
__doc__ = \
"""
Eastern Armenian Corpus
=======================
    
API for Eastern Armenian corpus (http://eanc.net).
    
**Search Parameters**

query: str or list([str])
    query or queries
n_results: int, default 100
    number of results wanted
kwic: bool, default True
    kwic format (True) or a sentence (False)
get_analysis: bool, default False
    tags shown (True) or not (False)

Example
-------
.. code-block:: python

    corp = lingcorpora.Corpus('arm')
    results = corp.search('նարդի', n_results=10)
    for result in results:
        for i, target in enumerate(result):
            print(i+1, target.text)

.. parsed-literal::

    "նարդի": 100%|██████████| 10/10 [00:08<00:00,  1.15docs/s]

    1 
    Նարդի խաղալիս նա այնպես էր փնչում Սիրունյանի երեսին, որ վերջինս ստիպված եղավ արագորեն տանուլ տալ խաղը: 
    2 « — Նարդի կուզես նե–կխաղամ, թուղթ չեմ խաղար», — պատասխանում է ղահվեճին և, քանի որ Աբոմարշը չի հակաճառում՝ նա նույնպես փակում է խանութը, բայց թուղթ չի փակցնում դռանը, որ գնում է ճաշի — և երկուսով միասին գնում են Տելեֆոն Սեթոյի սըրճարանը — նարդի խաղալու: 
    3 
    Նարդի խաղացողները լավ գիտեն, որ մինչեւ զառ գցելու հերթը հասնելը՝ գլուխ գովելը, միմյանց ջարդուփշուր անել խոստանալը պարտադիր արարողություն են: 
    4 
    Մի տեղ թուղթ են խաղում, մի ուրիշ տեղ նարդի չխկացնում:  
    5 
    Պատշգամբում այն զույգը դեռ նարդի է շրխկացնում և սարսափելի տխրություն կար այդ շրխկոցի մեջ, ինչպես առաջին անգամ թափվող ձյունի:  
    6 — Ոչ մի նարդի,– անհոգ վրա բերեց Ներսիսյանը, — պարապ ժամանակ՝ ո՞րտեղից: 
    7 
    Այգիներ հաճախել ամենից առաջ սիրում են շախմատ ու նարդի խաղացող եւ քաղաքական թեմաներով թունդ-թունդ վիճող պապիկները:  
    8 
    Ես Ֆրունզիկին ու Շերենցին արդժեն հրաժեշտ տվել ու անհամոզիչ բացատրություններ էի տալիս Ֆրունզիկին ու Շերենցին տեսած ու ճանաչած Կարոյին ու նարդի խաղացող մյուսներին, ու հիմա էլ՝ հենց էս պահին պարզապես անկարող եմ չթռչել ու չհասնել անկախության մեր էս օրերը, որովհետեւ ուղիղ երկու հազար թվականին, երբ Շիլաչու տունս ծախել ու Կայարանի էս տունս էի առել, տնափոխության պատճառով պրկված նյարդերս թուլացնելու նպատակով ամառվա իրիկուններն էլի սկսեցի գնալ «Պապլավոկ», ավելի ճիշտ՝ «Պապլավոկի» դիմացի «Դիմակ» սրճարան, ուր Օրթախ Աբոն, Հայկունը, Սերոբը, Ջոնը, Սադոյան Արշակն ու էլի ուրիշներ ամեն իրիկուն հավաքվում ու ամեն ինչից խոսում էին ու մինչեւ հիմա էլ խոսում են, բայց երկու հազար թվականի էդ ամառ հատկապե՛ս էինք խոսում, որովհետեւ էդ ամառ առանձնապե՛ս էր շոգ, ու գիշերները նույնիսկ քնել չէր լինում, ու էդ ամառվա շոգ գիշերները մենք հնարավորինս կրճատում էինք «Դիմակ» սրճարանում, եւ գիշերվա երկուսի ու երեքի արանքում ավտոմեքենայով ամեն օր ինձ տուն հասցնողը Սադոյան Արշակն էր, որովհետեւ համեմատաբար ի՛ր ճամփի վրա էի, ու էդ ամառ Արշակի «Զրո ութի» առջեւի աջ դուռը փչացել ու ներսից ոչ մի կերպ չէր բացվում, ու էդ ամռան ամեն Աստծո գիշեր Արշակն ինձ Կայարանի էս մեր նոր շենք հասցնելով` մեքենայից իջնում էր, դրսից բացում էր իմ կողմի դուռը, ու ես իջնում էի մեքենայից, ու քանի որ շատ շոգ գիշերներ էին, շենքի ջահելությունը դեռեւս արթուն էր լինում ու կուտակված էր լինում հատկապես մեր մուտքի մոտ, իսկ շենքի տղամարդկանցից որոշներն էլ էդ ժամին իրենց պատշգամբներում անքնությունից ծխում ու նայում էին ներքեւ, ուր «Լիմուզին» խանութի պայծառ լույսերի ներքո Արշակն ամեն Աստծո գիշեր իր «Զրո ութից» իջնում էր, դրսից իմ առջեւ բաց էր անում իր ավտոմեքենայի իմ կողմի դուռը, ու ես պատվավոր իջնում եւ մուտքի առաջ կուտակված ջահելների ու պատշգամբներում ծխող մեծերի ապշահար հայացքների ուղեկցությամբ մտնում էի շենք, ու հենց էդ ամառվանից սկսած՝ մեր էս նոր շենքի հարեւանությունն սկսեց առանձնակի հարգանքով բարեւել ինձ, իսկ հետո՝ երբ մի քանի անգամ հեռուստացույցով ինձ տեսան ու թերթերում էլ կարդացին էս ու այլ գրություններս, դրանից հարգանքս, կարելի է ասել, չավելացավ, եւ կարելի է ասել՝ նույնիսկ պակասե՛ց էլ, ու երեւի հենց էդպես էլ պիտի լիներ, որովհետեւ առավել աներեւակայելի տեսարան, քան Արշակի՝ իմ առջեւ ամեն Աստծո գիշեր իր «Զրո ութի» դուռը բացելն էր, մեր էս նոր հարեւանության երեւակայությունն ուղղակի չէր կարող պատկերացնել, եւ էս տեսարանն առավել անպատկերացնելի էր, քան յոթանասունվեց թվականի օգոստոսի վեցի, լույս յոթի գիշերվա՝ Կարոյի ու նարդի խաղացող մյուսների տեսածը, բայց յոթանասունվեցի էն գիշերվա իմ վիճակն անհամեմա՛տ էր բարդ, որովհետեւ, եթե Արշակի դեպքում իմ էս նոր հարեւանությունն ինձանից որեւէ բացատրություն չէր պահանջում, ապա յոթանասունվեցի օգոստոսի լույս յոթի էն գիշեր իմ ընկեր Կարոն ու նարդի խաղացող մյուսներն ինձանից, փաստորեն, բացատրություն ու արդարացում էին պահանջում: 
    9 
    Կամենաք, մի քիչ նարդի խաղանք պատշգամբի վրա: 
    10 
    Մեծ պարոնի տիրուհին, վրանց մեծ մայրը, ծալապատիկ նստած էր Արչիլ թավադի որդու տիկնոջ` Մելանիայի հանդեպ, և նարդու խաղատախտակը իրանց մեջտեղը դրած, նարդի էին խաղում:  

"""


class PageParser(PageParser):

    def __init__(self, *args, **kwargs):
        super().__init__(language, results, *args, **kwargs)
