from .arkhangelskiy_corpora import PageParser

language = 'buryat'
results = 'http://web-corpora.net/BuryatCorpus/search/results.php'

TEST_DATA = {'test_single_query': {'query': 'хөөшхэ'},
             'test_multi_query': {'query': ['хөөшхэ', 'дурлаха']}
             }

__author__ = 'ustya-k'
__doc__ = \
"""
Buryat Сorpus
=============

API for Buryat corpus (http://web-corpora.net/BuryatCorpus/search/).
    
**Search Parameters**

query: str or list([str]):
    query or queries
n_results: int, default 100
    number of results wanted
kwic: bool, default True
    kwic format (True) or a sentence (False)
get_analysis: bool, default False
    tags shown (True) or not (False)

Example
-------

.. code-block:: python

    corp = lingcorpora.Corpus('bua')
    results = corp.search('хэлэн', n_results=10)
    for result in results:
        for i, target in enumerate(result):
            print(i+1, target.text)

.. parsed-literal::

    "хэлэн": 100%|██████████| 10/10 [00:02<00:00,  4.14docs/s]

    1 
    Шэнэ начальнигуудай зангыень мэдэтэрээ мэдэлдэнь байһан хүндэ бэрхэ ха юм: хүн бүхэндэ хандаха, харюусаха дүрэ хэрэгтэй.– Ябууд дайнда орохобди гэжэ би һанаалби, – гэжэ Махмудов бага гажанхайшаг ород хэлэн дээрэ хэлэнэ.– Майор Толстовые Москва ябуулха гэжэ һананаб.  
    2 
    30-аад онуудта эхин һургуулиин бүхы учебнигүүд буряад хэлэндэ оршуулагдаад, буряад хэлэн дээрэ заагдадаг болобо.  
    3 
    Тэдэнэй урдаһаа уйгарай томо тэргэнүүдтэ эд бараа шэрэһэн хүнүүд, мүн тэдээнэй тэргэдэл адли тэргэтэйшүүд, гурбан сахаригтай велосипедтэйшье хүнүүд, ябага нюсэгэншье улад, һогтуушуул, һаари хирэшье болошоһон үхибүүд, англиин сагаан булочкануудые ашаһан гү, али элдэб помидор, үгэрсэшье шэрэһэн ябаган тэргэтэй хүнүүд, элжэгэн дээрэшье юумэ ашаһан наймаашад, зүһэн бүриин хэлэн дээрэ үлэн хооһон поршоонхонуудай бархиралдаанһаа өөрэгүйгөөр шэхэ дүлиирмэ шууяа гаргажа байбад.  
    4 
    Мүнөө үедэ кириллицэ үзэгтэй хори нютагай хэлэн буряад арадай литературна (ном бэшэгэй) хэлэн зандаа байна. 
    5 
    Энэ талаһаа олон тоото үргэн а, о, э аялгануудтай н, м, нг, л, р хахад аялгануудтай, хонгёо хашалгануудтай, мүн тэрээн дээрэ үшөө үсөөн тоото уйтан аялганууд болон бүдэхи хашалгануудтай, к, ц, ч, щ абяануудгүй буряад хэлэн баһа таатай юм. 
    6 
    Мүн лэ энэ зорилгоор Буряадай Доржи Банзаровай нэрэмжэтэ багшанарай институдай бүхы факультедэй буряад студентнэртэ буряад хэлэн заагдадаг болобо. 
    7 
    Һайрхан хэлэн һуухаш, эхэмни. 
    8 
    Юрэдөөл, хүнэй хэлэн газаагуур ошодоггүй юм байна даа.  
    9 
    Харин дуун лэ галта даляараа зүрхынь сорьёжо, наһан соогоо баянай барлаг боложо тулиһаншье һаа, нэгэнэйньшье урда һүгэдэжэ, айжа унаагүй, хуурмаг үгын һүүдэршье хэлэн дээрээ асаржа үзөөгүй сэхэ зантан нүхэрыень, омог залуу наһан соогоо ажабайдалай халуун шулуу долёонгүй, дайнай хүйтэн мүртэ дайрагдажа, бусалтагүй ошоһон хайрата ганса хүбүүень мүнөөдэр мэтэ элихэнээр мүндэлүүлжэ үгэдэг. 
    10 
    Бишни Винницын хүм.— Теэд ород хэлэн дээрэ аргагүй сэбэрээр дуугарналта!— Тиигэнгүй яахабши.  

"""


class PageParser(PageParser):

    def __init__(self, *args, **kwargs):
        super().__init__(language, results, *args, **kwargs)
