from .arkhangelskiy_corpora import PageParser

language = 'greek'
results = 'http://web-corpora.net/GreekCorpus/search/results.php'

TEST_DATA = {'test_single_query': {'query': 'γάτα'},
             'test_multi_query': {'query': ['γάτα', 'αγάπη']}
             }

__author__ = 'ustya-k'
__doc__ = \
"""
Modern Greek Corpus
===================

API for Modern Greek corpus (http://web-corpora.net/GreekCorpus/search/).

**Search Parameters**

query: str or list([str])
    query or queries
n_results: int, default 100
    number of results wanted
kwic: bool, default True
    kwic format (True) or a sentence (False)
get_analysis: bool, default False
    tags shown (True) or not (False)

Example
-------

.. code-block:: python

    corp = lingcorpora.Corpus('grk')
    results = corp.search('γλώσσα', n_results=10)
    for result in results:
        for i, target in enumerate(result):
            print(i+1, target.text)

.. parsed-literal::
    
    "γλώσσα": 100%|██████████| 10/10 [00:03<00:00,  2.95docs/s]

    1 
    Έτσι, στο όνομα του Ιησού όλα τα επουράνια, τα επίγεια και τα υποχθόνια θα προσκυνήσουν,και κάθε γλώσσα θα ομολογήσει ότι Κύριος είναι ο Ιησούς Χριστός, για να δοξάζεται έτσι ο θεός 
    2 
    Στο χωριό σήμερα ζουν περίπου 1.200 κάτοικοι, από τους οποίους οι 250-300 μιλούν την ελληνική γλώσσα. 
    3 
    Προτιμώ λοιπόν να το πω διότι αυτή είναι η γλώσσα της αλήθειας.  
    4  «Για την Ελλάδα οι διαπραγματεύσεις που γίνονται στο πλαίσιο του ΟΗΕ έχουν χρονικό ορίζοντα και είναι η πρόσκληση της γειτονικής χώρας στο ΝΑΤΟ » υπογράμμισε η ελληνίδα ΥΠΕΞ Σκληρή γλώσσα έναντι των Σκοπίων χρησιμοποίησε η Ντόρα Μπακογιάννη από τις Βρυξέλλες, μετά και τη νέα πρόκληση των γειτόνων μας να μην επιτρέψουν την ελληνική εθνική ομάδα της σκοποβολής να περάσει από το έδαφός τους, κάτι το οποίο ούτε καν σχολίασε η ηγεσία της ΠΓΔΜ.  
    5 
    Τα μαθήματα διδάσκονται από Ελληνες και ξένους (σε κάθε γλώσσα) διδάσκοντες.  
    6 
    Η αρνητική γλώσσα του παρελθόντος έχει προκαλέσει απώλειες και δεν πρέπει να χαραμίσουμε άλλο χρόνο ή ενέργεια σε αυτήν.  
    7 
    Φέτος, λόγω του κακού προγραμματισμού των διευθύνσεων Δευτεροβάθμιας Εκπαίδευσης και μετά από αδικαιολόγητη καθυστέρηση, προσλήφθηκαν τελικά στο τέλος της σχολικής χρονιάς 52 αναπληρωτές, με αποτέλεσμα 5.000 μαθητές σε όλη τη χώρα που είχαν επιλέξει να διδαχθούν την Ιταλική Γλώσσα να μείνουν στα προαύλια των σχολείων σε κενή-ελεύθερη ώρα ή να προωθηθούν σε άλλη γλώσσα. 
    8 
    Νομίζουμε ότι επειδή έχουμε σταρ μπροστά στην κάμερα, γνωρίζουμε τη γλώσσα του σώματος.  
    9 
    Σε νέα βερσιόν, στην αγγλική γλώσσα, ετοιμάζεται να κυκλοφορήσει από τη Sony Pictures Classics, το γαλλικό πολιτικό δράμα κινουμένων σχεδίων «Περσέπολις ».  
    10 
    Ο υποθάλαμος, δηλαδή, είναι ένα υπερόργανο, όπου τα μυστηριώδη μηνύματα του εγκεφάλου, τα οποία προέρχονται από εξωτερικά ή εσωτερικά ερεθίσματα και τ’αξιοποιούν οι αισθήσεις, μετατρέπονται σε μηνύματα νευροδιαβιβαστών και ηλεκτρικών παλμών και μεταφράζονται τελικά σε μια νέα γλώσσα: τη γλώσσα των ορμονών του υποθαλάμου.  
    
"""


class PageParser(PageParser):

    def __init__(self, *args, **kwargs):
        super().__init__(language, results, *args, **kwargs)
