from .arkhangelskiy_corpora import PageParser

language = 'kalmyk'
results = 'http://web-corpora.net/KalmykCorpus/search/results.php'

TEST_DATA = {'test_single_query': {'query': 'мис'},
             'test_multi_query': {'query': ['мис', 'бәәх']}
             }

__author__ = 'ustya-k'
__doc__ = \
"""
Kalmyk Corpus
=============

API for Kalmyk corpus (http://web-corpora.net/KalmykCorpus/search/).
    
**Search Parameters**


query: str or list([str])
    query or queries
n_results: int, default 100
    number of results wanted
kwic: bool, default True
    kwic format (True) or a sentence (False) (True by default)
get_analysis: bool, default False
    tags shown (True) or not (False)

Example
-------

.. code-block:: python

    corp = lingcorpora.Corpus('kal')
    results = corp.search('келн', n_results=10)
    for result in results:
        for i, target in enumerate(result):
            print(i+1, target.text)

.. parsed-literal::

    "келн": 100%|██████████| 10/10 [00:01<00:00,  6.95docs/s]

    1 
    Үлгүрнь, Рафаэль Дусейнов маңһд келн көвүн, болв хальмг келнд, Манҗин Аркадин дуунд йир дурта. 
    2 
    Дәкәд «АПК-н делгрлт» гидг келн-улсин төсвәр районд государственн лизингәр чигн мал хулдҗ авад өскҗәнә гив. 
    3 
    Хар гөрәр цааҗлгдад, Сиврүр туугдсн төрскн келн-улсин һашута зовлңгинь Көглтин Дава хувалцсмн. 
    4 
    Олна советин гешүд болҗах Хальмг Таңһчд әмтнә зөв харслһна күцц зөвтә элчин үүл дааҗах Владислав Сависько, Өмн үзгин федеральн округд Әрәсән Президентин күцц зөвтә элчин аппаратын федеральн инспектор Александр Беляев, таңһчд үүлдҗәх «Ислам» гидг мусульманск цутхлңгин һардач Магомед-Шапи Магомедов, Хальмг Таңһчин шаҗн лам Тэло Тулку Ринпочен нөкд Хоңһр Эльбиков, сойлын болн олнд зәңгллһнә коммуникацсин министерствин әңгин һардач Григорий Деликов, хасг келн-улсин «Жерлестер» цутхлңгин һардач Пётр Идрисов болн нань чигн улс тоолврарн хувалцв. 
    5 
    Комиссин гешүд Городовиковск балһсар, селәдәр йовад, әмтнлә харһад, күүндәд, келн-улсин дөрвн төсвиг яһҗ күцәдгинь медүлв. 
    6  «Совещание МСХиПрода» Келн-улсин селәнә эдл-ахун төрәр Хальмг Таңһчин 21 эдл-аху орн-нутгин программд орулгдҗана. 
    7 
    Ар Кавказд кесг жилин туршт тогтҗах нәрн бәәдлд кесг җилдән хам-хоша үр-иньгинәр бәәсн келн улс хоорндан цүүгә татдг, өшә көөлддг йовдлмуд дегд ик болҗ одв. 
    8 
    Төрскн келн Төрскн келән медый, өргҗүлий! 
    9 
    Хальмг Таңһчин өргн теегин нег захд бәәх Баһ Дөрвдә района Ик Бухс селәнә улс эврәннь келн улсин сойлдан, төрскн келндән дурта. 
    10 
    Сүл цагт эрүл-менд харлһна туст батлгдсн келн-улсин төсвсиг бәәдл-җирһлд тохралһна тускар күүндвр болна гих кергтә. 

"""


class PageParser(PageParser):

    def __init__(self, *args, **kwargs):
        super().__init__(language, results, *args, **kwargs)
