from .arkhangelskiy_corpora import PageParser

language = 'kazakh'
results = 'http://web-corpora.net/KazakhCorpus/search/results.php'

TEST_DATA = {'test_single_query': {'query': 'мысық'},
             'test_multi_query': {'query': ['мысық', 'сүю']}
             }

__author__ = 'ustya-k'
__doc__ = \
"""
Almaty Corpus of the Kazakh Language
====================================
    
API for Almaty corpus of the Kazakh language
(http://web-corpora.net/KazakhCorpus/search/).
    
**Search Parameters**

query: str or list([str]):
    query or queries
n_results: int, default 100
    number of results wanted
kwic: bool, default True
    kwic format (True) or a sentence (False)
get_analysis: bool, default False
    tags shown (True) or not (False)

Example
-------

.. code-block:: python

    corp = lingcorpora.Corpus('kaz')
    results = corp.search('тілі', n_results=10)
    for result in results:
        for i, target in enumerate(result):
            print(i+1, target.text)

.. parsed-literal::

    "тілі": 100%|██████████| 10/10 [00:01<00:00,  6.49docs/s]

    1 
    Ағылшын тілі пәнінің модульдік оқыту технологиясының элементтері ойындар мен шығармашылық жұмыстарды қолдана оқыту арқылы: балалардың білімге деген қызығушылығы мен білім дәрежесі артады; оқушының қисынды ойлауын, қабілеттерін, көзге елестету қабілетін, жадын, шығармашылығы дамытылады; оқушылардың ішкі қуатымен мүмкіндіктері ашылады; ұжымдық, топтық, жеке жұмыс түрлері арқылы, өзара достыққа, көмекке , қиындықты бірге жеңуге, адамгершілік қасиеттерге үйретеді; оқушының танымдық қасиеттері дамиды; белсенді сөздік қорын, ауызша және жазбаша тілін дамытады. 
    2 
    2. Ана тілі мен ағылшын тілін араластырып сөйлемеу керек.  
    3 
    Интернет жүйесінің келесі ақпараттық қоры мен ресурстарын шетел тілі сабағында пайдалану бірден-бір тиімді болмақ:• электрондық пошта (e-mail), телеконфереция, видеоконференция;• жеке ақпараттарды жарыққа шығару мүмкіндігі немесе басқаша айтқанда Web• серверге жеке шығару;• ақпараттық каталогтар ( Yahoo, InfoSeek/UltraSmart, Galaxy) іздеу жүйесі (Altta, Vista, HotBob, Open Text), жүйе ішіндегі әңгіме (Chat). 
    4 
    Ол жалмауыздың саған қарап жалақтаған тілі де, шырағым. 
    5 
    Ағылшын тілі сабағында ақпараттық технологияны пайдалану 
    6 
    Бұл жұмыстың басты мақсаты компьютер желісін және мультимедиялық-электрондық құралдарды шет тілі сабағында тиімді қолдану, нақтылап айтқанда ағылшын тілі сабағында презентацияларды және мультимедиялық-электрондық құралдарды мектеп қабырғасында және білім беру процесінде терең қолдану.  
    7 
    Ағылшын тілі сабағын оқытуда таным қабілетін арттыру арқылы ағылшын тілі сабағын өткізуге оқыту әдістемесін теориялық тұрғыдан негіздеу, яғни: ағылшын тілі сабағын өткізуде сөздің айтылуы мен естілуі жұмыстарын ұйымдастыру проблемаларын зерттеу; оқулық негізінде ағылшын тілі сабағын өткізуде сөздің айтылуы мен естілуі жұмыстарын ұйымдастыру барысында болашақ мұғалімдерді оқыту әдістемесін жасау; оқулық негізінде ағылшын тілі сабағын өткізуге болашақ мұғалімдерді оқыту әдістемесін тиімді зерттеу тұрғысынан эксперимент жүргізу.  
    8  «Газет – халықтың көзі, құлағы һәм тілі ».  
    9 
    Шетел тілі сабағында компьютермен жұмыс жасай отырып, студенттер психологиялық тұрғыдан да жеңілдіктерге ие болады.  
    10 
    Сондықтан да ағылшын тілі мұғалімдеріне қойылатын талаптар ауқымы үлкен.  

"""


class PageParser(PageParser):

    def __init__(self, *args, **kwargs):
        super().__init__(language, results, *args, **kwargs)
