from .arkhangelskiy_corpora import PageParser

language = 'yiddish'
results = 'http://web-corpora.net/YNC/search/results.php'

TEST_DATA = {'test_single_query': {'query': 'קאַץ'},
             'test_multi_query': {'query': ['קאַץ', 'ליבע']}
             }

__author__ = 'ustya-k'
__doc__ = \
"""
Modern Yiddish Corpus
=====================

API for Modern Yiddish corpus (http://web-corpora.net/YMC/search/).
    
**Search Parameters**

query: str or list([str])
    query or queries
n_results: int, default 100
    number of results wanted
kwic: bool, default True
    kwic format (True) or a sentence (False)
get_analysis: bool, default False
    tags shown (True) or not (False)

    
Example
-------

.. code-block:: python

    corp = lingcorpora.Corpus('yid')
    results = corp.search('gut', n_results=10)
    for result in results:
        for i, target in enumerate(result):
            print(i+1, target.text)

.. parsed-literal::

    "gut": 100%|██████████| 10/10 [00:01<00:00,  5.17docs/s]

    1 
    עס איז גוט באַקאַנט, אַז די פּאַרטײ און סטאַלין אַלײן האָבן געהאַלטן אַ וואַכיק אויג אויף דער ליטעראַטור און קונסט. 
    2 
    זיכער האָט ראַבײַ טראַוויס געווירקט אויפֿן אָנגעזאַמלטן עולם וועלכער האָט גאַנץ גוט געוווּסט וואָס עס מיינט אַראָפּצונידערן אַליין, און אַ סך פֿון אים האָבן גאַנץ גוט געוווּסט וואָס מען מיינט מיטן זאָג "זײַן," צי דאָס האָט געמיינט צו באַקלערן זיך, צו טראַכטן אָדער צו לעבן אינעם מאָמענט. 
    3 
    עס וואָלט געווען גוט צו וויסן צי איבערזעצונגען פֿון ייִדיש, "משפּחה מאַשבער“ בתוכם, ווערן געלייענט אין די לייען-קלובן און קרײַזלעך, וואָס זענען טעטיק אין אַלע וויקנלעך פֿון דער וועלט. 
    4 
    אַ גרויסע טייל פֿאַבריקן האָבן אין גאַנצן אײַנגעשטעלט אָפּגעשטעלט די אַרבעט, אַנדערע האָבן דערווײַל נאָר אָפּגעזאָגט האַלב אָדער צוויי-דריטל פֿון זייערע אַרבעטער, ווײַל זיי האָבן נאָך גערעכנט, אַז דער פּלוצלונגער קריזיס וועט שנעל איבערגיין און די געשעפֿטן וועלן צוריק אויפֿלעבן ווי געווען; אָבער די אמתע קלוגע געשעפֿטסלײַט, וועלכע האָבן גוט פֿאַרשטאַנען פֿון וואַנען דער פּלוצלונגער קריזיס האָט זיך גענומען, האָבן ניט פֿיל געהאָפֿט אויף דער צוקונפֿט. 
    5 
    ווען מע שטרעבט צו זײַן גוט און צו אַנטפּלעקן ג־טלעכקייט אין זיך און אין דער אַרומיקער וועלט, קאָן מען דערגרייכן דאָס אמתע חשיבֿות פֿון דער מענטשלעכער נשמה, די מדרגה פֿון "אַשר לא ימד ולא יספר", דאָס ליכט פֿונעם ג-טלעכן אין־סוף, וואָס פֿאַראייניקט דאָס גאַנצע וועזן, העכער פֿון אַלע גרענעצן און חשבונות. 
    6 
    און לסוף, די אייביקע פֿראַגע: צי איז גוט דער נײַער פּרעזידענט פֿאַר די ייִדן? 
    7 
    31:18 זי מערקט אַז איר פֿאַרדינסט איז גוט; ניט פֿאַרלאָשן בייַ נאַכט ווערט איר ליכט. 
    8 
    דער אמתער "בערמודער דרײַעק", וואָס געפֿינט זיך אין אַטלאַנטישן אָקעאַן, צווישן די בערמודער אינדזלען, פּוערטאָ־ריקאָ און פֿלאָרידע, איז גוט באַקאַנט, ווי אַן אָרט, וווּ עס לויערט די סכּנה איבער די שיפֿן אומגעבראַכט אָדער פֿאַרשוווּנדן צו ווערן. 
    9 
    אַזוי איז זרח געקומען נאָך יאָהרען אַהיים צו זייַן ווייַב צירלען צוריק, וימצאה בריאה ושלמה, און האָט זי געפונען געזונד און פריש, וואָרום זי האָט די גאַנצע צאָהל יאָהר נישט איין מינוט פערלוירען דעם בטחון, און האָט יעדען טאָג געהאָפט צו גאָט, אַז זרח איהר מאַן וועט קומען אַהיים און אַלץ וועט נאָך ווערען גוט. 
    10 
    זיי ווייסן גענוי, וואָס איז גוט און וואָס איז שלעכט. 

"""


class PageParser(PageParser):

    def __init__(self, *args, **kwargs):
        super().__init__(language, results, *args, **kwargs)
